{
  "backend/main.mo": "Main Motoko actor defining Note, ImportantNote, and Book types with CRUD operations; Book type uses optional pdfBase64/pdfFileName fields instead of URL-based fields, and uses migration on startup.",
  "backend/migration.mo": "Migration module that transforms the old Book type (with accessLink, coverImageUrl, important fields) to the new Book type (with optional pdfBase64 and pdfFileName fields), preserving all other actor state.",
  "feature_evidence.json": "Feature evidence report documenting two implemented features: replacing URL fields with PDF upload in the Book form/backend, and updating BookCard to open PDFs via Base64 data URI instead of an external link.",
  "frontend-file-summaries.txt": "Auto-generated summaries of all frontend source files, describing each component, page, hook, and config file's purpose and key changes (e.g., PDF upload support, Base64 handling).",
  "frontend/index.css": "Tailwind CSS entry file defining OKLCH-based CSS custom properties for light and dark themes, covering background, foreground, primary, accent, chart, and sidebar color tokens.",
  "frontend/index.html": "Minimal HTML shell for the StudyShare React app, mounting the app into a root div and loading the main TypeScript entry point as an ES module.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with a shared Layout (Navbar + Footer) and defines all seven application routes including home, notes, important notes, books, and detail pages.",
  "frontend/src/components/BookCard.tsx": "Book card component that displays title, author, subject, description, and PDF filename; includes an 'Open Book' button that opens the stored PDF in a new tab via a Base64 data URI, or shows 'No PDF Available' when absent.",
  "frontend/src/components/Footer.tsx": "App footer displaying the StudyHub brand, dynamic copyright year, and a caffeine.ai attribution link with UTM tracking parameters.",
  "frontend/src/components/ImportantNoteCard.tsx": "Renders a card UI for an ImportantNote, supporting a featured variant with a star badge and accent styling, and a standard variant with subject tag and date.",
  "frontend/src/components/Navbar.tsx": "Sticky top navigation bar with logo, desktop nav links, and a collapsible mobile menu, using TanStack Router for active-link detection.",
  "frontend/src/components/NoteCard.tsx": "Displays a note's title, subject (color-coded), description, uploader, date, and view count, with a button to open the note as a PDF or navigate to its detail page.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) via React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing DFINITY AuthClient login/logout state and persisting identity across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for fetching and mutating Notes, ImportantNotes, and Books against the ICP backend actor, including CRUD operations and view-count tracking.",
  "frontend/src/index.css": "Global CSS file that imports Google Fonts (Merriweather, Inter), sets up Tailwind directives, and defines CSS custom properties for a light/dark academic color palette along with utility classes like paper-texture and card-hover.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with QueryClientProvider (React Query) and InternetIdentityProvider before mounting to the DOM.",
  "frontend/src/pages/BooksPage.tsx": "Page for browsing and adding study books, featuring search/subject filtering, a book card grid, and a dialog form with PDF upload support that calls the addBook mutation.",
  "frontend/src/pages/BrowseNotesPage.tsx": "Page that displays all student-shared notes in a filterable grid, supporting search by title/description and filtering by subject using data from the useGetAllNotes hook.",
  "frontend/src/pages/HomePage.tsx": "Landing page with a hero banner, stats section showing note/book counts, and feature cards linking to Browse Notes, Important Notes, and Books pages.",
  "frontend/src/pages/ImportantNoteDetailPage.tsx": "Detail page for a single important note, fetched by title from URL params, displaying its subject, featured badge, creation date, and full content.",
  "frontend/src/pages/ImportantNotesPage.tsx": "Page listing curated important notes split into featured and non-featured sections, with search and subject filter controls using useGetAllImportantNotes and useGetFeaturedImportantNotes hooks.",
  "frontend/src/pages/NoteDetailPage.tsx": "Displays the full detail view of a single note fetched by title, including metadata, PDF download/preview, and a delete action with confirmation dialog. Increments the view count on load and navigates back to browse notes on deletion.",
  "frontend/src/pages/ShareNotesPage.tsx": "Provides a form for students to submit a new note with title, subject, description, uploader name, optional text content, and an optional PDF upload. Validates input, converts the PDF to base64, and submits via the addNote mutation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling dark mode, custom OKLCH-based color tokens, extended typography/border-radius/shadow scales, and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks the overall project state including version, feature list with IDs and requirement mappings, architectural notes, and known issues for the study-platform application."
}