{
  "backend/main.mo": "Main Motoko actor defining Note, ImportantNote, and Book types with CRUD operations including add, get, delete, view count increment, and subject/featured filtering for each entity type.",
  "backend/migration.mo": "Migration module that defines the actor state shape (notes, importantNotes, books maps) and exports a no-op `run` function that passes the old state through unchanged.",
  "feature_evidence.json": "Feature evidence report listing three implemented features: delete note with confirmation, book upload form, and Open Note/PDF button, each mapped to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Pre-generated summaries of all frontend source files describing each component, page, hook, and config file's purpose and key functionality.",
  "frontend/index.css": "Tailwind base CSS file defining OKLCH-based CSS custom properties for light and dark color themes including background, foreground, primary, accent, chart, and sidebar tokens.",
  "frontend/index.html": "Minimal HTML entry point titled 'StudyShare' with a root div and a module script tag loading the React app from src/main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with a Layout wrapper (Navbar + Outlet + Footer) and defines seven routes: home, browse-notes, share-notes, important-notes, books, note detail, and important-note detail.",
  "frontend/src/components/BookCard.tsx": "Reusable card component for displaying a book with cover image or placeholder, subject badge, author, description, important star indicator, and an Access Book button that opens the download link in a new tab.",
  "frontend/src/components/Footer.tsx": "App footer displaying the StudyHub logo, dynamic copyright year, and a caffeine.ai attribution link with UTM parameters derived from the current hostname.",
  "frontend/src/components/ImportantNoteCard.tsx": "Renders a card UI for an ImportantNote, supporting a featured variant with a star badge and accent styling, and a standard variant with subject tag and date.",
  "frontend/src/components/Navbar.tsx": "Sticky top navigation bar with logo, desktop nav links, and a collapsible mobile menu, highlighting the active route using TanStack Router.",
  "frontend/src/components/NoteCard.tsx": "Displays a Note as a card with subject color-coding, uploader info, view count, and a button to open the note as a PDF or navigate to its detail page.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (anonymous or authenticated) using TanStack Query, and invalidates dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider context and useInternetIdentity hook for managing DFINITY AuthClient login, logout, and identity state with status tracking.",
  "frontend/src/hooks/useQueries.ts": "Centralizes TanStack Query hooks for all backend operations including CRUD for Notes, ImportantNotes, and Books, wiring each to the actor from useActor.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts (Merriweather, Inter), sets up Tailwind CSS, and defines CSS custom properties for a light/dark academic warm color palette along with utility classes like paper-texture and card-hover.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with TanStack QueryClientProvider and a custom InternetIdentityProvider before mounting to the DOM.",
  "frontend/src/pages/BooksPage.tsx": "Page for browsing and adding study books, featuring search/filter controls by subject and importance, a book card grid, and a dialog form with validation for submitting new books via the useAddBook mutation.",
  "frontend/src/pages/BrowseNotesPage.tsx": "Page that displays all student-shared notes in a filterable grid, supporting search by title/description and filtering by subject, with loading skeletons and empty/error states.",
  "frontend/src/pages/HomePage.tsx": "Landing page featuring a hero banner, live stats (note/book counts), and feature cards linking to Browse Notes, Important Notes, and Books sections.",
  "frontend/src/pages/ImportantNoteDetailPage.tsx": "Detail view for a single important note, fetched by decoded title from URL params, displaying subject badge, featured status, creation date, and full note content with loading/error states.",
  "frontend/src/pages/ImportantNotesPage.tsx": "Page listing curated important notes split into featured and non-featured sections, with search and subject filter controls, loading skeletons, and navigation to individual note detail pages.",
  "frontend/src/pages/NoteDetailPage.tsx": "Displays the full detail view of a single note identified by URL title param, including metadata, PDF viewer/download, and delete functionality with confirmation dialog.",
  "frontend/src/pages/ShareNotesPage.tsx": "Provides a form page for students to submit new notes with title, subject, description, text content, uploader name, and optional PDF upload, submitting via the addNote mutation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, custom color tokens (using oklch CSS variables), typography, border radius, box shadows, and animation keyframes for the app's academic visual theme.",
  "project_state.json": "Tracks the project's current state including version, feature list, known issues (broken note sharing), and architectural notes for the study platform."
}