{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Replace book upload form fields with PDF file upload only",
  "requirements": [
    {
      "id": "REQ-19",
      "summary": "Update the Book upload form to remove URL fields and replace with PDF file upload, reading the file as Base64 and displaying the filename",
      "acceptanceCriteria": [
        "The book upload form no longer shows an 'Access Link (URL)' input field",
        "The book upload form no longer shows a 'Cover Image URL' input field",
        "A PDF file upload input is present in the book upload form",
        "Selecting a PDF file displays the filename near the upload input",
        "The selected PDF file is read as Base64 before submission",
        "Submitting the form sends pdfBase64 and pdfFileName to the backend via useAddBook",
        "Title, author, subject, and description fields remain in the form"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/BooksPage.tsx",
          "operation": "modify",
          "description": "Remove the 'Access Link (URL)' and 'Cover Image URL' input fields from the book upload form dialog. Add a PDF file upload input with type='file' accept='.pdf'. Add state to track the selected PDF file and its Base64 representation. When a PDF is selected, read it using FileReader as Base64 and store both the Base64 string and filename in component state. Display the selected filename next to the file input. Update the form submission handler to pass pdfBase64 and pdfFileName to the useAddBook mutation instead of the removed URL fields. Retain all existing fields: title, author, subject, and description."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update the useAddBook mutation to accept pdfBase64 and pdfFileName parameters instead of accessLink and coverImageUrl. Pass these new parameters to the backend actor's addBook method, converting them to null if undefined to match the backend interface signature (string | null). Ensure the mutation invalidates the books query cache on success."
        }
      ]
    },
    {
      "id": "REQ-20",
      "summary": "Update BookCard to replace the 'Access Book' button with an 'Open Book' button that opens stored PDFs inline using Base64 data URI",
      "acceptanceCriteria": [
        "The Book type in backend/main.mo includes pdfBase64: ?Text and pdfFileName: ?Text fields",
        "The addBook function accepts pdfBase64 and pdfFileName parameters",
        "BookCard renders an 'Open Book' button when pdfBase64 is present",
        "Clicking 'Open Book' opens the PDF in a new browser tab using a Base64 data URI",
        "The backend migration.mo is updated if the Book state shape changes"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/BookCard.tsx",
          "operation": "modify",
          "description": "Replace the existing 'Access Book' button (which opens book.accessLink) with an 'Open Book' button. The button should only be enabled when book.pdfBase64 is present. On click, construct a Base64 data URI using the format 'data:application/pdf;base64,' + book.pdfBase64, then open it in a new browser tab using window.open(). Update the button text to 'Open Book' and adjust any conditional rendering logic to check for pdfBase64 instead of accessLink."
        }
      ]
    }
  ]
}